---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledOuterPerimeter
source: html/c9e65d57-e306-0549-4b52-91eb47926b8a.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledOuterPerimeter Property

The outer perimeter of the extrusion, scaled to the units of export.

## Syntax (C#)
```csharp
public double ScaledOuterPerimeter { get; set; }
```